const configTexts = {
    time: {
        'C6': '600文字',
        'C5': '500文字',
        'C4': '400文字',
        'C3': '300文字',
        'C2': '200文字',
        'C1': '100文字',
        'SA': '全問',
        'S6': '60問',
        'S5': '50問',
        'S4': '40問',
        'S3': '30問',
        'S2': '20問',
        'S1': '10問',
        'M5': '5分',
        'M4': '4分',
        'M3': '3分',
        'M2': '2分',
        'M1': '1分',
        'M0': '0分'
    },
    level :{
        's1': '文(N1)',
        's2': '文(N2)',
        's3': '文(N3)',
        'b1': '単語＋文(N1)',
        'b2': '単語＋文(N2)',
        'b3': '単語＋文(N3)',
        'w6': '単語(N1)',
        'w7': '単語(N2)',
        'w8': '単語(N3)',
        'c4': 'ひらがな1',
        'c5': 'ひらがな2'
    },
    ruby :{
        '2':'すべて',
        '1':'漢字だけ',
        '0':'なし'
    },
    useRandom :{
        'on':'ランダム',
        'off':'ふつう',
    }
}