const configTexts = {
    time: {
        'c9': '900文字',
        'c8': '800文字',
        'c7': '700文字',
        'c6': '600文字',
        'c5': '500文字',
        'c4': '400文字',
        'c3': '300文字',
        'c2': '200文字',
        'c1': '100文字',
        'sa': '全問',
        's9': '90問',
        's6': '80問',
        's7': '70問',
        's6': '60問',
        's5': '50問',
        's4': '40問',
        's3': '30問',
        's2': '20問',
        's1': '10問',
        'm9': '9分',
        'm8': '8分',
        'm7': '7分',
        'm6': '6分',
        'm5': '5分',
        'm4': '4分',
        'm3': '3分',
        'm2': '2分',
        'm1': '1分',
        'm0': '0分'
    },
    level :{
        's1': 'むずかしい(N1)',
        's2': 'ふつう(N2)',
        's3': 'かんたん(N3)',
        's4': 'やさしい(N4)',
        'h1': 'ひらがな1',
        'h2': 'ひらがな2',
        'a1': 'アルファベット'
    },
    mode :{
        'm0':'ふつう',
        'm1':'単語くりかえし',
        'm2':'単語きりだし'
    },
    ruby :{
        'r0':'すべて',
        'r1':'漢字だけ',
        'r2':'なし'
    },
    order :{
        'o0':'問題順',
        'o1':'ランダム',
    }
}