const configTexts = {
    time: {
        'C6': '600文字',
        'C5': '500文字',
        'C4': '400文字',
        'C3': '300文字',
        'C2': '200文字',
        'C1': '100文字',
        'SA': '全問',
        'S6': '60問',
        'S5': '50問',
        'S4': '40問',
        'S3': '30問',
        'S2': '20問',
        'S1': '10問',
        'M5': '5分',
        'M4': '4分',
        'M3': '3分',
        'M2': '2分',
        'M1': '1分',
        'M0': '0分'
    },
    level :{
        's1': 'むずかしい(N1)',
        's2': 'ふつう(N2)',
        's3': 'かんたん(N3)',
        'c4': 'ひらがな1',
        'c5': 'ひらがな2',
        'c6': 'アルファベット'
    },
    mode :{
        'pm0':'ふつう',
        'pm1':'単語くりかえし',
        'pm2':'単語きりだし'
    },
    ruby :{
        'dr0':'すべて',
        'dr1':'漢字だけ',
        'dr2':'なし'
    },
    order :{
        'od0':'ふつう',
        'od1':'ランダム',
    }
}